[
    {
        "id": "01",
        "name": "JavaScript for Beginners",
        "courseBanner": "https://i.postimg.cc/MKRFQjZB/js.png",
        "courseIntro": "Learn javascript online and supercharge your web design with this Javascript for beginners training course.",
        "courseDetails": "Our JavaScript Tutorial is designed for beginners and professionals both. JavaScript is used to create client-side dynamic pages. JavaScript is an object-based scripting language which is lightweight and cross-platform. JavaScript is not a compiled language, but it is a translated language. The JavaScript Translator (embedded in the browser) is responsible for translating the JavaScript code for the web browser.",
        "about": "JavaScript is a dynamic computer programming language. It is lightweight and most commonly used as a part of web pages, whose implementations allow client-side script to interact with the user and make dynamic pages. It is an interpreted programming language with object-oriented capabilities.  JavaScript was first known as LiveScript, but Netscape changed its name to JavaScript, possibly because of the excitement being generated by Java. JavaScript made its first appearance in Netscape 2.0 in 1995 with the name LiveScript. The general-purpose core of the language has been embedded in Netscape, Internet Explorer, and other web browsers.",
        "language": "English",
        "cost": "35.50",
        "enrolled": "355",
        "instructor": {
            "name": "Akash Akter",
            "image": "https://i.postimg.cc/zXFVncR5/akash.png"
        },
        "category": "Programming Language"
    },
    {
        "id": "02",
        "name": "Learn C++",
        "courseBanner": "https://i.postimg.cc/B6VxhNpv/cpp.png",
        "courseIntro": "This course covers C++ from very basic to more advanced features. Concepts of C++ programming are made very simple and easy.",
        "courseDetails": "C++ Language Course Details: Candidates who are desirous of getting Certification in C++ can check for the course-related info. You can avail information on Duration, Fee, Eligibility, Admission, Syllabus, Jobs, and Salary Offered. Students having a basic knowledge of Computers can undergo this course and have a great career ahead. You can have diverse options to join after finishing the C++ Certification Course.",
        "about": "C++ is an object-oriented programming language that is simple and modern and a general-purpose programming language for application development. This can be great for students who wish to enter the Object-Oriented Programming. The Course is designed in a way that develops basics and skills of C++ Language to Students. It gives Programmers a high level of control over system resources and memory. This cross-platform language can be used to create high-level applications. Aspirants who have done this course can have a wide range of opportunities open up in various platforms.",
        "language": "English",
        "cost": "25.50",
        "enrolled": "455",
        "instructor": {
            "name": "Syed Farhan Reza",
            "image": "https://i.postimg.cc/yNtd1q2h/farhan.png"
        },
        "category": "Programming Language"
    },
    {
        "id": "03",
        "name": "C Programming Language",
        "courseBanner": "https://i.postimg.cc/2jgtyxYm/c.png",
        "courseIntro": "C Programming will increase career options. Become a better dev in other languages by learning C. Pointers explained",
        "courseDetails": "Have you never programmed a computer before, and think or have been told that C is a good programming language to get started with.  It is! Maybe you have some experience with other programming languages, but want to learn C.  It's a great language to add to your resume! Or perhaps you are stuck in a low paying programming job, and want to move up to a better, more senior position.  Learning C can help you!  The fact is, learning how to program in C is not only an excellent programming language to get started with, but it will also make you a better programming in other computer languages!",
        "about": "C is often considered to be the mother of all languages because so many other languages have been based on it. Though C is simple it is one of the most powerful languages ever created.  Considering it was created over 40 years ago, it is still used heavily and is usually in the top 5 or 10 most popular and most widely programming languages in the world.  Learning C can actually make you a better programming in other languages like C++, Java, or C# by equipping you with a mental model of what the computer is actually doing when you run your programs. By learning how things really work under the hood, and understand memory space, CPU architecture and so on, you can create more efficient programs, and obtain a huge advantage over other programmers in the process. If you want to become a better developer, learning C is a great way to start!",
        "language": "English",
        "cost": "20.50",
        "enrolled": "215",
        "instructor": {
            "name": "Syed Farhan Reza",
            "image": "https://i.postimg.cc/yNtd1q2h/farhan.png"
        },
        "category": "Programming Language"
    },
    {
        "id": "04",
        "name": "CSS Tutorial",
        "courseBanner": "https://i.postimg.cc/y8HrXYWb/css.png",
        "courseIntro": "The most advanced and modern CSS course on the internet: master flexbox, CSS Grid, responsive design, and so much more.",
        "courseDetails": "Ever wonder how the latest website designs are made? Cascading Style Sheets (CSS) are the main coding files used to lay out a website and its design. CSS3 is the latest in styling standards, and it brings several new properties and declarations you can use to make your website design more easily created. CSS is currently the only standard in website design that plugs directly into your HTML, even the latest HTML5 standards. With CSS3 and HTML5, you can create the latest interactive pages for your website viewers.!",
        "about": "Cascading Style Sheets, fondly referred to as CSS, is a simple design language intended to simplify the process of making web pages presentable. CSS handles the look and feel part of a web page. Using CSS, you can control the color of the text, the style of fonts, the spacing between paragraphs, how columns are sized and laid out, what background images or colors are used, layout designs,variations in display for different devices and screen sizes as well as a variety of other effects. CSS is easy to learn and understand but it provides powerful control over the presentation of an HTML document. Most commonly, CSS is combined with the markup languages HTML or XHTML.",
        "language": "English",
        "cost": "20.50",
        "enrolled": "215",
        "instructor": {
            "name": "Hridoy Khan",
            "image": "https://i.postimg.cc/XJ5vXH0R/hridoy.png"
        },
        "category": "Desgining"
    },
    {
        "id": "05",
        "name": "Design with Bootstrap",
        "courseBanner": "https://i.postimg.cc/855RBxh3/bootstrap.png",
        "courseIntro": "Master all parts of Bootstrap 5 and customization with Sass using Learning Kit, coding exercises, quizzes and much more.",
        "courseDetails": "Bootstrap 5 is evolving with each release to better utilize CSS variables for global theme styles, individual components, and even utilities. We provide dozens of variables for colors, font styles, and more at a :root level for use anywhere. On components and utilities, CSS variables are scoped to the relevant class and can easily be modified.",
        "about": "Bootstrap - the world's most popular front-end frameworks! This course covers all the different parts of the latest version of the world's most popular front-end framework, Bootstrap 5.1.1 from September 7, 2021. Bootstrap has been used on millions of websites around the world and have been carefully developed to cover a wide range of typical user interfaces. Web pages built with Bootstrap 5 works across all kinds of devices, browsers and screen sizes while also taking care of accessibility and a clean and modern design. This course is for the beginner who want to learn Bootstrap 5 from the bottom up. It goes through all the different parts, but each lecture can be watched independently. After learning about all the different parts you will learn how to customize and extend Bootstrap 5 with Sass. First of all, I will show you how to compile Sass with the Koala app and introduce you to the Bootstrap 5 Sass files. Then I will show you many examples of how you can customize and extend Bootstrap 5 by changing global options as well as changing the settings and styles for color, layout, content, forms, components, helpers and utilities.",
        "language": "English",
        "cost": "20.50",
        "enrolled": "215",
        "instructor": {
            "name": "Hridoy Khan",
            "image": "https://i.postimg.cc/XJ5vXH0R/hridoy.png"
        },
        "category": "Desgining"
    },
    {
        "id": "06",
        "name": "Tailwind Tutorial",
        "courseBanner": "https://i.postimg.cc/PJv10ZVQ/tailwind.png",
        "courseIntro": "Learn Tailwind by building a fully responsive real estate portal & interactive dashboard. Become a TailwindCSS expert",
        "courseDetails": "Tailwind CSS is basically a utility-first CSS framework for rapidly building custom user interfaces. It is a highly customizable, low-level CSS framework that gives you all of the building blocks you need to build bespoke designs without any annoying opinionated styles you have to fight to override.",
        "about": "Tailwind CSS is a utility-first CSS framework designed to enable users to create applications faster and easier. You can use utility classes to control the layout, color, spacing, typography, shadows, and more to create a completely custom component design — without leaving your HTML or writing a single line of custom CSS. Now you might be wondering why use Tailwind over other CSS frameworks? Tailwind CSS is a low-level framework. Meaning, unlike other CSS frameworks like Bootstrap and Materialize, Tailwind doesn't offer fully styled components like buttons, dropdowns, and navbars. Instead, it offers utility classes so you can create your own reusable components. For that reason, it provides a lot more flexibility and control over what your application looks like than other CSS frameworks. This can enable you to create a more unique site.",
        "language": "English",
        "cost": "20.50",
        "enrolled": "215",
        "instructor": {
            "name": "Hridoy Khan",
            "image": "https://i.postimg.cc/XJ5vXH0R/hridoy.png"
        },
        "category": "Desgining"
    },
    {
        "id": "07",
        "name": "React Tutorial",
        "courseBanner": "https://i.postimg.cc/nM8qxz6b/react.png",
        "courseIntro": "Dive in and learn React.js from scratch! Learn Reactjs, Hooks, Redux, React Routing, Animations, Next.js and way more!",
        "courseDetails": "This course is fully up-to-date with React 18 (the latest version of React)! It was completely updated and re-recorded from the ground up - it teaches the very latest version of React with all the core, modern features you need to know! This course also comes with two paths which you can take: The complete path (full >40h course) and the summary path (~4h summary module) - you can choose the path that best fits your time requirements! React.js is THE most popular JavaScript library you can use and learn these days to build modern, reactive user interfaces for the web. This course teaches you React in-depth, from the ground up, step by step by diving into all the core basics, exploring tons of examples and also introducing you to advanced concepts as well.  You'll get all the theory, tons of examples and demos, assignments and exercises and tons of important knowledge that is skipped by most other resources - after all, there is a reason why this course is that huge! And in case you don't even know why you would want to learn React and you're just here because of some ad or the algorithm- no worries: ReactJS is a key technology as a web developer and in this course I will also explain WHY it's that important!",
        "about": "React makes it painless to create interactive UIs. Design simple views for each state in your application, and React will efficiently update and render just the right components when your data changes. Declarative views make your code more predictable and easier to debug. Build encapsulated components that manage their own state, then compose them to make complex UIs. Since component logic is written in JavaScript instead of templates, you can easily pass rich data through your app and keep state out of the DOM. We don't make assumptions about the rest of your technology stack, so you can develop new features in React without rewriting existing code. React can also render on the server using Node and power mobile apps using React Native. React components implement a render() method that takes input data and returns what to display. This example uses an XML-like syntax called JSX. Input data that is passed into the component can be accessed by render() via this.props. JSX is optional and not required to use React. Try the Babel REPL to see the raw JavaScript code produced by the JSX compilation step.",
        "language": "English",
        "cost": "35.50",
        "enrolled": "355",
        "instructor": {
            "name": "Akash Akter",
            "image": "https://i.postimg.cc/zXFVncR5/akash.png"
        },
        "category": "Web Development"
    },
    {
        "id": "08",
        "name": "DS & Algorithms - Python",
        "courseBanner": "https://i.postimg.cc/855RBxh3/bootstrap.png",
        "courseIntro": "Python DSA for Coding Interview with Animated Examples -- Watch Intro Video to See the Advantage of Learning Visually",
        "courseDetails": "An overview of data structure concepts, arrays, stack, queues, trees, and graphs. Discussion of various implementations of these data objects, programming styles, and run-time representations. Course also examines algorithms for sorting, searching and some graph algorithms.",
        "about": "A computer program is a collection of instructions to perform a specific task. For this, a computer program may need to store data, retrieve data, and perform computations on the data. A data structure is a named location that can be used to store and organize data. And, an algorithm is a collection of steps to solve a particular problem. Learning data structures and algorithms allow us to write efficient and optimized computer programs. This is an excellent, up-to-date and easy-to-use text on data structures and algorithms that is intended for undergraduates in computer science and information science. The thirteen chapters, written by an international group of experienced teachers, cover the fundamental concepts of algorithms and most of the important data structures as well as the concept of interface design. The book contains many examples and diagrams. Whenever appropriate, program codes are included to facilitate learning.",
        "language": "English",
        "cost": "18.50",
        "enrolled": "215",
        "instructor": {
            "name": "Syed Farhan Reza",
            "image": "https://i.postimg.cc/yNtd1q2h/farhan.png"
        }
    },
    {
        "id": "09",
        "name": "Artificial Intelligence",
        "courseBanner": "https://i.postimg.cc/0NZGS9JD/AI.png",
        "courseIntro": "Combine the power of Data Science, Machine Learning and Deep Learning to create powerful AI for Real-World applications!",
        "courseDetails": "Complete beginner to expert AI skills, Learn to code self-improving AI for a range of purposes. In fact, we code together with you. Every tutorial starts with a blank page and we write up the code from scratch. This way you can follow along and understand exactly how the code comes together and what each line means. You'll get downloadable Python code templates for every AI you build in the course. This makes building truly unique AI as simple as changing a few lines of code. If you unleash your imagination, the potential is unlimited. Where most courses simply bombard you with dense theory and set you on your way, we believe in developing a deep understanding for not only what you're doing, but why you're doing it. That's why we don't throw complex mathematics at you, but focus on building up your intuition in coding AI making for infinitely better results down the line. You'll achieve your goal in not only 1 game but in 3. Each module is comprised of varying structures and difficulties, meaning you'll be skilled enough to build AI adaptable to any environment in real life, rather than just passing a glorified memory “test and forget” like most other courses. Practice truly does make perfect. We're fully committed to making this the most accessible and results-driven AI course on the planet. This requires us to be there when you need our help. That's why we've put together a team of professional Data Scientists to support you in your journey, meaning you'll get a response from us within 48 hours maximum.",
        "about": "Artificial intelligence (AI), the ability of a digital computer or computer-controlled robot to perform tasks commonly associated with intelligent beings. The term is frequently applied to the project of developing systems endowed with the intellectual processes characteristic of humans, such as the ability to reason, discover meaning, generalize, or learn from past experience. Since the development of the digital computer in the 1940s, it has been demonstrated that computers can be programmed to carry out very complex tasks—as, for example, discovering proofs for mathematical theorems or playing chess—with great proficiency. Still, despite continuing advances in computer processing speed and memory capacity, there are as yet no programs that can match human flexibility over wider domains or in tasks requiring much everyday knowledge. On the other hand, some programs have attained the performance levels of human experts and professionals in performing certain specific tasks, so that artificial intelligence in this limited sense is found in applications as diverse as medical diagnosis, computer search engines, and voice or handwriting recognition.",
        "language": "English",
        "cost": "45.50",
        "enrolled": "355",
        "instructor": {
            "name": "Akash Akter",
            "image": "https://i.postimg.cc/zXFVncR5/akash.png"
        }
    }
]